[net]
batch = 64
subdivisions = 8
# Training
width = 512
height = 512
# width = 608
# height = 608
channels = 3
momentum = 0.949
decay = 0.0005
angle = 0
saturation = 1.5
exposure = 1.5
hue = .1
second_index = 105

learning_rate = 0.0013
burn_in = 1000
max_batches = 500500
policy = steps
steps = 400000,450000
scales = .1,.1

#cutmix=1
mosaic = 1

#:104x104 54:52x52 85:26x26 104:13x13 for 416

### 可见光模态特征提取网络

[convolutional]
batch_normalize = 1
filters = 32
size = 3
stride = 1
pad = 1
activation = mish

# Downsample

[convolutional]
batch_normalize = 1
filters = 64
size = 3
stride = 2
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 64
size = 1
stride = 1
pad = 1
activation = mish

[route]
layers = -2

[convolutional]
batch_normalize = 1
filters = 64
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 32
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 64
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear

[convolutional]
batch_normalize = 1
filters = 64
size = 1
stride = 1
pad = 1
activation = mish

[route]
layers = -1,-7

[convolutional]
batch_normalize = 1
filters = 64
size = 1
stride = 1
pad = 1
activation = mish

# Downsample

[convolutional]
batch_normalize = 1
filters = 128
size = 3
stride = 2
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 64
size = 1
stride = 1
pad = 1
activation = mish

[route]
layers = -2

[convolutional]
batch_normalize = 1
filters = 64
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 64
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 64
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear

[convolutional]
batch_normalize = 1
filters = 64
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 64
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear

[convolutional]
batch_normalize = 1
filters = 64
size = 1
stride = 1
pad = 1
activation = mish

[route]
layers = -1,-10

[convolutional]
batch_normalize = 1
filters = 128
size = 1
stride = 1
pad = 1
activation = mish

# Downsample

[convolutional]
batch_normalize = 1
filters = 256
size = 3
stride = 2
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 128
size = 1
stride = 1
pad = 1
activation = mish

[route]
layers = -2

[convolutional]
batch_normalize = 1
filters = 128
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 128
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 128
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear

[convolutional]
batch_normalize = 1
filters = 128
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 128
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear

[convolutional]
batch_normalize = 1
filters = 128
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 128
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear

[convolutional]
batch_normalize = 1
filters = 128
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 128
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear


[convolutional]
batch_normalize = 1
filters = 128
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 128
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear

[convolutional]
batch_normalize = 1
filters = 128
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 128
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear

[convolutional]
batch_normalize = 1
filters = 128
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 128
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear

[convolutional]
batch_normalize = 1
filters = 128
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 128
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear

[convolutional]
batch_normalize = 1
filters = 128
size = 1
stride = 1
pad = 1
activation = mish

[route]
layers = -1,-28

[convolutional]
batch_normalize = 1
filters = 256
size = 1
stride = 1
pad = 1
activation = mish

# Downsample

[convolutional]
batch_normalize = 1
filters = 512
size = 3
stride = 2
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 256
size = 1
stride = 1
pad = 1
activation = mish

[route]
layers = -2

[convolutional]
batch_normalize = 1
filters = 256
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 256
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 256
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear


[convolutional]
batch_normalize = 1
filters = 256
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 256
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear


[convolutional]
batch_normalize = 1
filters = 256
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 256
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear


[convolutional]
batch_normalize = 1
filters = 256
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 256
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear


[convolutional]
batch_normalize = 1
filters = 256
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 256
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear


[convolutional]
batch_normalize = 1
filters = 256
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 256
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear


[convolutional]
batch_normalize = 1
filters = 256
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 256
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear

[convolutional]
batch_normalize = 1
filters = 256
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 256
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear

[convolutional]
batch_normalize = 1
filters = 256
size = 1
stride = 1
pad = 1
activation = mish

[route]
layers = -1,-28

[convolutional]
batch_normalize = 1
filters = 512
size = 1
stride = 1
pad = 1
activation = mish

# Downsample

[convolutional]
batch_normalize = 1
filters = 1024
size = 3
stride = 2
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 512
size = 1
stride = 1
pad = 1
activation = mish

[route]
layers = -2

[convolutional]
batch_normalize = 1
filters = 512
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 512
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 512
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear

[convolutional]
batch_normalize = 1
filters = 512
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 512
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear

[convolutional]
batch_normalize = 1
filters = 512
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 512
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear

[convolutional]
batch_normalize = 1
filters = 512
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 512
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear

[convolutional]
batch_normalize = 1
filters = 512
size = 1
stride = 1
pad = 1
activation = mish

[route]
layers = -1,-16

[convolutional]
batch_normalize = 1
filters = 1024
size = 1
stride = 1
pad = 1
activation = mish

#### 红外光模态特征提取网络

[convolutional]
batch_normalize = 1
filters = 32
size = 3
stride = 1
pad = 1
activation = mish

# Downsample

[convolutional]
batch_normalize = 1
filters = 64
size = 3
stride = 2
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 64
size = 1
stride = 1
pad = 1
activation = mish

[route]
layers = -2

[convolutional]
batch_normalize = 1
filters = 64
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 32
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 64
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear

[convolutional]
batch_normalize = 1
filters = 64
size = 1
stride = 1
pad = 1
activation = mish

[route]
layers = -1,-7

[convolutional]
batch_normalize = 1
filters = 64
size = 1
stride = 1
pad = 1
activation = mish

# Downsample

[convolutional]
batch_normalize = 1
filters = 128
size = 3
stride = 2
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 64
size = 1
stride = 1
pad = 1
activation = mish

[route]
layers = -2

[convolutional]
batch_normalize = 1
filters = 64
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 64
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 64
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear

[convolutional]
batch_normalize = 1
filters = 64
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 64
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear

[convolutional]
batch_normalize = 1
filters = 64
size = 1
stride = 1
pad = 1
activation = mish

[route]
layers = -1,-10

[convolutional]
batch_normalize = 1
filters = 128
size = 1
stride = 1
pad = 1
activation = mish

# Downsample

[convolutional]
batch_normalize = 1
filters = 256
size = 3
stride = 2
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 128
size = 1
stride = 1
pad = 1
activation = mish

[route]
layers = -2

[convolutional]
batch_normalize = 1
filters = 128
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 128
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 128
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear

[convolutional]
batch_normalize = 1
filters = 128
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 128
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear

[convolutional]
batch_normalize = 1
filters = 128
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 128
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear

[convolutional]
batch_normalize = 1
filters = 128
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 128
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear


[convolutional]
batch_normalize = 1
filters = 128
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 128
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear

[convolutional]
batch_normalize = 1
filters = 128
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 128
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear

[convolutional]
batch_normalize = 1
filters = 128
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 128
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear

[convolutional]
batch_normalize = 1
filters = 128
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 128
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear

[convolutional]
batch_normalize = 1
filters = 128
size = 1
stride = 1
pad = 1
activation = mish

[route]
layers = -1,-28

[convolutional]
batch_normalize = 1
filters = 256
size = 1
stride = 1
pad = 1
activation = mish

# Downsample

[convolutional]
batch_normalize = 1
filters = 512
size = 3
stride = 2
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 256
size = 1
stride = 1
pad = 1
activation = mish

[route]
layers = -2

[convolutional]
batch_normalize = 1
filters = 256
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 256
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 256
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear


[convolutional]
batch_normalize = 1
filters = 256
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 256
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear


[convolutional]
batch_normalize = 1
filters = 256
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 256
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear


[convolutional]
batch_normalize = 1
filters = 256
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 256
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear


[convolutional]
batch_normalize = 1
filters = 256
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 256
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear


[convolutional]
batch_normalize = 1
filters = 256
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 256
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear


[convolutional]
batch_normalize = 1
filters = 256
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 256
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear

[convolutional]
batch_normalize = 1
filters = 256
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 256
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear

[convolutional]
batch_normalize = 1
filters = 256
size = 1
stride = 1
pad = 1
activation = mish

[route]
layers = -1,-28

[convolutional]
batch_normalize = 1
filters = 512
size = 1
stride = 1
pad = 1
activation = mish

# Downsample

[convolutional]
batch_normalize = 1
filters = 1024
size = 3
stride = 2
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 512
size = 1
stride = 1
pad = 1
activation = mish

[route]
layers = -2

[convolutional]
batch_normalize = 1
filters = 512
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 512
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 512
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear

[convolutional]
batch_normalize = 1
filters = 512
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 512
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear

[convolutional]
batch_normalize = 1
filters = 512
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 512
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear

[convolutional]
batch_normalize = 1
filters = 512
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 512
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear

[convolutional]
batch_normalize = 1
filters = 512
size = 1
stride = 1
pad = 1
activation = mish

[route]
layers = -1,-16

[convolutional]
batch_normalize = 1
filters = 1024
size = 1
stride = 1
pad = 1
activation = mish

# fusion

[route]
layers = -51, 159

[convolutional]
batch_normalize = 1
filters = 256
size = 3
stride = 1
pad = 1
activation = leaky

[route]
layers = -22, -127

[convolutional]
batch_normalize = 1
filters = 512
size = 3
stride = 1
pad = 1
activation = leaky

[route]
layers = -5, -110

[convolutional]
batch_normalize = 1
filters = 1024
size = 3
stride = 1
pad = 1
activation = leaky

# fusion end

########################## 加强特征提取网络

[convolutional]
batch_normalize = 1
filters = 512
size = 1
stride = 1
pad = 1
activation = leaky

[convolutional]
batch_normalize = 1
size = 3
stride = 1
pad = 1
filters = 1024
activation = leaky

[convolutional]
batch_normalize = 1
filters = 512
size = 1
stride = 1
pad = 1
activation = leaky

### SPP ###
[maxpool]
stride = 1
size = 5

[route]
layers = -2

[maxpool]
stride = 1
size = 9

[route]
layers = -4

[maxpool]
stride = 1
size = 13

[route]
layers = -1,-3,-5,-6
### End SPP ###

[convolutional]
batch_normalize = 1
filters = 512
size = 1
stride = 1
pad = 1
activation = leaky

[convolutional]
batch_normalize = 1
size = 3
stride = 1
pad = 1
filters = 1024
activation = leaky

[convolutional]
batch_normalize = 1
filters = 512
size = 1
stride = 1
pad = 1
activation = leaky

[convolutional]
batch_normalize = 1
filters = 256
size = 1
stride = 1
pad = 1
activation = leaky

[upsample]
stride = 2

[route]
layers = 213

[convolutional]
batch_normalize = 1
filters = 256
size = 1
stride = 1
pad = 1
activation = leaky

[route]
layers = -1, -3

[convolutional]
batch_normalize = 1
filters = 256
size = 1
stride = 1
pad = 1
activation = leaky

[convolutional]
batch_normalize = 1
size = 3
stride = 1
pad = 1
filters = 512
activation = leaky

[convolutional]
batch_normalize = 1
filters = 256
size = 1
stride = 1
pad = 1
activation = leaky

[convolutional]
batch_normalize = 1
size = 3
stride = 1
pad = 1
filters = 512
activation = leaky

[convolutional]
batch_normalize = 1
filters = 256
size = 1
stride = 1
pad = 1
activation = leaky

[convolutional]
batch_normalize = 1
filters = 128
size = 1
stride = 1
pad = 1
activation = leaky

[upsample]
stride = 2

[route]
layers = 211

[convolutional]
batch_normalize = 1
filters = 128
size = 1
stride = 1
pad = 1
activation = leaky

[route]
layers = -1, -3

[convolutional]
batch_normalize = 1
filters = 128
size = 1
stride = 1
pad = 1
activation = leaky

[convolutional]
batch_normalize = 1
size = 3
stride = 1
pad = 1
filters = 256
activation = leaky

[convolutional]
batch_normalize = 1
filters = 128
size = 1
stride = 1
pad = 1
activation = leaky

[convolutional]
batch_normalize = 1
size = 3
stride = 1
pad = 1
filters = 256
activation = leaky

[convolutional]
batch_normalize = 1
filters = 128
size = 1
stride = 1
pad = 1
activation = leaky

##########################

[convolutional]
batch_normalize = 1
size = 3
stride = 1
pad = 1
filters = 256
activation = leaky

[convolutional]
size = 1
stride = 1
pad = 1
filters = 18
activation = linear


[yolo]
mask = 0,1,2
anchors = 17, 35, 18, 46, 23, 43, 22, 56, 26, 70, 30, 60, 34, 82, 40, 109, 57, 157
classes = 1
num = 9
jitter = .3
ignore_thresh = .7
truth_thresh = 1
scale_x_y = 1.2
iou_thresh = 0.213
cls_normalizer = 1.0
iou_normalizer = 0.07
iou_loss = ciou
nms_kind = greedynms
beta_nms = 0.6
max_delta = 5


[route]
layers = -4

[convolutional]
batch_normalize = 1
size = 3
stride = 2
pad = 1
filters = 256
activation = leaky

[route]
layers = -1, -16

[convolutional]
batch_normalize = 1
filters = 256
size = 1
stride = 1
pad = 1
activation = leaky

[convolutional]
batch_normalize = 1
size = 3
stride = 1
pad = 1
filters = 512
activation = leaky

[convolutional]
batch_normalize = 1
filters = 256
size = 1
stride = 1
pad = 1
activation = leaky

[convolutional]
batch_normalize = 1
size = 3
stride = 1
pad = 1
filters = 512
activation = leaky

[convolutional]
batch_normalize = 1
filters = 256
size = 1
stride = 1
pad = 1
activation = leaky

###########

[convolutional]
batch_normalize = 1
size = 3
stride = 1
pad = 1
filters = 512
activation = leaky

[convolutional]
size = 1
stride = 1
pad = 1
filters = 18
activation = linear


[yolo]
mask = 3,4,5
anchors = 17, 35, 18, 46, 23, 43, 22, 56, 26, 70, 30, 60, 34, 82, 40, 109, 57, 157
classes = 1
num = 9
jitter = .3
ignore_thresh = .7
truth_thresh = 1
scale_x_y = 1.1
iou_thresh = 0.213
cls_normalizer = 1.0
iou_normalizer = 0.07
iou_loss = ciou
nms_kind = greedynms
beta_nms = 0.6
max_delta = 5


[route]
layers = -4

[convolutional]
batch_normalize = 1
size = 3
stride = 2
pad = 1
filters = 512
activation = leaky

[route]
layers = -1, -37

[convolutional]
batch_normalize = 1
filters = 512
size = 1
stride = 1
pad = 1
activation = leaky

[convolutional]
batch_normalize = 1
size = 3
stride = 1
pad = 1
filters = 1024
activation = leaky

[convolutional]
batch_normalize = 1
filters = 512
size = 1
stride = 1
pad = 1
activation = leaky

[convolutional]
batch_normalize = 1
size = 3
stride = 1
pad = 1
filters = 1024
activation = leaky

[convolutional]
batch_normalize = 1
filters = 512
size = 1
stride = 1
pad = 1
activation = leaky

[convolutional]
batch_normalize = 1
size = 3
stride = 1
pad = 1
filters = 1024
activation = leaky

[convolutional]
size = 1
stride = 1
pad = 1
filters = 18
activation = linear


[yolo]
mask = 6,7,8
anchors = 17, 35, 18, 46, 23, 43, 22, 56, 26, 70, 30, 60, 34, 82, 40, 109, 57, 157
classes = 1
num = 9
jitter = .3
ignore_thresh = .7
truth_thresh = 1
random = 1
scale_x_y = 1.05
iou_thresh = 0.213
cls_normalizer = 1.0
iou_normalizer = 0.07
iou_loss = ciou
nms_kind = greedynms
beta_nms = 0.6
max_delta = 5