[net]
batch = 64
subdivisions = 8
# Training
width = 512
height = 512
channels = 3
momentum = 0.949
decay = 0.0005
angle = 0
saturation = 1.5
exposure = 1.5
hue = .1

learning_rate = 0.0013
burn_in = 1000
max_batches = 500500
policy = steps
steps = 400000,450000
scales = .1,.1
second_index = 55

#cutmix=1
mosaic = 1

#:104x104 54:52x52 85:26x26 104:13x13 for 416

[convolutional]
batch_normalize = 1
filters = 32
size = 3
stride = 1
pad = 1
activation = mish

# Downsample

[convolutional]
batch_normalize = 1
filters = 64
size = 3
stride = 2
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 64
size = 1
stride = 1
pad = 1
activation = mish

[route]
layers = -2

[convolutional]
batch_normalize = 1
filters = 64
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 32
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 64
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear

[convolutional]
batch_normalize = 1
filters = 64
size = 1
stride = 1
pad = 1
activation = mish

[route]
layers = -1,-7

[convolutional]
batch_normalize = 1
filters = 64
size = 1
stride = 1
pad = 1
activation = mish

# Downsample

[convolutional]
batch_normalize = 1
filters = 128
size = 3
stride = 2
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 64
size = 1
stride = 1
pad = 1
activation = mish

[route]
layers = -2

[convolutional]
batch_normalize = 1
filters = 64
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 64
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 64
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear

[convolutional]
batch_normalize = 1
filters = 64
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 64
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear

[convolutional]
batch_normalize = 1
filters = 64
size = 1
stride = 1
pad = 1
activation = mish

[route]
layers = -1,-10

[convolutional]
batch_normalize = 1
filters = 128
size = 1
stride = 1
pad = 1
activation = mish

# Downsample

[convolutional]
batch_normalize = 1
filters = 256
size = 3
stride = 2
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 128
size = 1
stride = 1
pad = 1
activation = mish

[route]
layers = -2

[convolutional]
batch_normalize = 1
filters = 128
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 128
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 128
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear

[convolutional]
batch_normalize = 1
filters = 128
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 128
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear

[convolutional]
batch_normalize = 1
filters = 128
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 128
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear

[convolutional]
batch_normalize = 1
filters = 128
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 128
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear


[convolutional]
batch_normalize = 1
filters = 128
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 128
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear

[convolutional]
batch_normalize = 1
filters = 128
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 128
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear

[convolutional]
batch_normalize = 1
filters = 128
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 128
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear

[convolutional]
batch_normalize = 1
filters = 128
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 128
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear

[convolutional]
batch_normalize = 1
filters = 128
size = 1
stride = 1
pad = 1
activation = mish

[route]
layers = -1,-28

[convolutional]
batch_normalize = 1
filters = 256
size = 1
stride = 1
pad = 1
activation = mish

###################### infrared

[convolutional]
batch_normalize = 1
filters = 32
size = 3
stride = 1
pad = 1
activation = mish

# Downsample

[convolutional]
batch_normalize = 1
filters = 64
size = 3
stride = 2
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 64
size = 1
stride = 1
pad = 1
activation = mish

[route]
layers = -2

[convolutional]
batch_normalize = 1
filters = 64
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 32
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 64
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear

[convolutional]
batch_normalize = 1
filters = 64
size = 1
stride = 1
pad = 1
activation = mish

[route]
layers = -1,-7

[convolutional]
batch_normalize = 1
filters = 64
size = 1
stride = 1
pad = 1
activation = mish

# Downsample

[convolutional]
batch_normalize = 1
filters = 128
size = 3
stride = 2
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 64
size = 1
stride = 1
pad = 1
activation = mish

[route]
layers = -2

[convolutional]
batch_normalize = 1
filters = 64
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 64
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 64
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear

[convolutional]
batch_normalize = 1
filters = 64
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 64
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear

[convolutional]
batch_normalize = 1
filters = 64
size = 1
stride = 1
pad = 1
activation = mish

[route]
layers = -1,-10

[convolutional]
batch_normalize = 1
filters = 128
size = 1
stride = 1
pad = 1
activation = mish

# Downsample

[convolutional]
batch_normalize = 1
filters = 256
size = 3
stride = 2
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 128
size = 1
stride = 1
pad = 1
activation = mish

[route]
layers = -2

[convolutional]
batch_normalize = 1
filters = 128
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 128
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 128
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear

[convolutional]
batch_normalize = 1
filters = 128
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 128
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear

[convolutional]
batch_normalize = 1
filters = 128
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 128
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear

[convolutional]
batch_normalize = 1
filters = 128
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 128
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear


[convolutional]
batch_normalize = 1
filters = 128
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 128
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear

[convolutional]
batch_normalize = 1
filters = 128
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 128
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear

[convolutional]
batch_normalize = 1
filters = 128
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 128
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear

[convolutional]
batch_normalize = 1
filters = 128
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 128
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear

[convolutional]
batch_normalize = 1
filters = 128
size = 1
stride = 1
pad = 1
activation = mish

[route]
layers = -1,-28

[convolutional]
batch_normalize = 1
filters = 256
size = 1
stride = 1
pad = 1
activation = mish

# 第一层fusion

[route]
layers = 54, 109

[convolutional]
batch_normalize = 1
filters = 256
size = 3
stride = 1
pad = 1
activation = leaky

[se]
squeeze_factor = 4

# 第一层fusion end

[shortcut]
from = 54
weights_type = 1.0
activation = linear

# DownSample

[convolutional]
batch_normalize = 1
filters = 512
size = 3
stride = 2
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 256
size = 1
stride = 1
pad = 1
activation = mish

[route]
layers = -2

[convolutional]
batch_normalize = 1
filters = 256
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 256
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 256
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear


[convolutional]
batch_normalize = 1
filters = 256
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 256
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear


[convolutional]
batch_normalize = 1
filters = 256
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 256
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear


[convolutional]
batch_normalize = 1
filters = 256
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 256
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear


[convolutional]
batch_normalize = 1
filters = 256
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 256
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear


[convolutional]
batch_normalize = 1
filters = 256
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 256
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear


[convolutional]
batch_normalize = 1
filters = 256
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 256
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear

[convolutional]
batch_normalize = 1
filters = 256
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 256
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear

[convolutional]
batch_normalize = 1
filters = 256
size = 1
stride = 1
pad = 1
activation = mish

[route]
layers = -1,-28

[convolutional]
batch_normalize = 1
filters = 512
size = 1
stride = 1
pad = 1
activation = mish

[route]
layers = 112

[shortcut]
from = 109
weights_type = 1.0
activation = linear

# Downsample

[convolutional]
batch_normalize = 1
filters = 512
size = 3
stride = 2
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 256
size = 1
stride = 1
pad = 1
activation = mish

[route]
layers = -2

[convolutional]
batch_normalize = 1
filters = 256
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 256
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 256
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear


[convolutional]
batch_normalize = 1
filters = 256
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 256
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear


[convolutional]
batch_normalize = 1
filters = 256
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 256
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear


[convolutional]
batch_normalize = 1
filters = 256
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 256
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear


[convolutional]
batch_normalize = 1
filters = 256
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 256
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear


[convolutional]
batch_normalize = 1
filters = 256
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 256
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear


[convolutional]
batch_normalize = 1
filters = 256
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 256
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear

[convolutional]
batch_normalize = 1
filters = 256
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 256
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear

[convolutional]
batch_normalize = 1
filters = 256
size = 1
stride = 1
pad = 1
activation = mish

[route]
layers = -1,-28

[convolutional]
batch_normalize = 1
filters = 512
size = 1
stride = 1
pad = 1
activation = mish

# 第二层fusion

[route]
layers = 144, 177

[convolutional]
batch_normalize = 1
filters = 512
size = 3
stride = 1
pad = 1
activation = leaky

[se]
squeeze_factor = 4

# 第二层fusion end

[shortcut]
from = 144
weights_type = 1.0
activation = linear

# Downsample

[convolutional]
batch_normalize = 1
filters = 1024
size = 3
stride = 2
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 512
size = 1
stride = 1
pad = 1
activation = mish

[route]
layers = -2

[convolutional]
batch_normalize = 1
filters = 512
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 512
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 512
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear

[convolutional]
batch_normalize = 1
filters = 512
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 512
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear

[convolutional]
batch_normalize = 1
filters = 512
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 512
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear

[convolutional]
batch_normalize = 1
filters = 512
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 512
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear

[convolutional]
batch_normalize = 1
filters = 512
size = 1
stride = 1
pad = 1
activation = mish

[route]
layers = -1,-16

[convolutional]
batch_normalize = 1
filters = 1024
size = 1
stride = 1
pad = 1
activation = mish

[route]
layers = 180

[shortcut]
from = 177
weights_type = 1.0
activation = linear

# Downsample

[convolutional]
batch_normalize = 1
filters = 1024
size = 3
stride = 2
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 512
size = 1
stride = 1
pad = 1
activation = mish

[route]
layers = -2

[convolutional]
batch_normalize = 1
filters = 512
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 512
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 512
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear

[convolutional]
batch_normalize = 1
filters = 512
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 512
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear

[convolutional]
batch_normalize = 1
filters = 512
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 512
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear

[convolutional]
batch_normalize = 1
filters = 512
size = 1
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 512
size = 3
stride = 1
pad = 1
activation = mish

[shortcut]
from = -3
activation = linear

[convolutional]
batch_normalize = 1
filters = 512
size = 1
stride = 1
pad = 1
activation = mish

[route]
layers = -1,-16

[convolutional]
batch_normalize = 1
filters = 1024
size = 1
stride = 1
pad = 1
activation = mish

# 第三层fusion

[route]
layers = 200, 221

[convolutional]
batch_normalize = 1
filters = 1024
size = 3
stride = 1
pad = 1
activation = leaky

[se]
squeeze_factor = 4

######################

[convolutional]
batch_normalize = 1
filters = 512
size = 1
stride = 1
pad = 1
activation = leaky

[convolutional]
batch_normalize = 1
size = 3
stride = 1
pad = 1
filters = 1024
activation = leaky

[convolutional]
batch_normalize = 1
filters = 512
size = 1
stride = 1
pad = 1
activation = leaky

### SPP ###
[maxpool]
stride = 1
size = 5

[route]
layers = -2

[maxpool]
stride = 1
size = 9

[route]
layers = -4

[maxpool]
stride = 1
size = 13

[route]
layers = -1,-3,-5,-6

### End SPP ###

[convolutional]
batch_normalize = 1
filters = 512
size = 1
stride = 1
pad = 1
activation = leaky


[convolutional]
batch_normalize = 1
size = 3
stride = 1
pad = 1
filters = 1024
activation = leaky

[convolutional]
batch_normalize = 1
filters = 512
size = 1
stride = 1
pad = 1
activation = leaky

[convolutional]
batch_normalize = 1
size = 3
stride = 1
pad = 1
filters = 1024
activation = leaky

[convolutional]
size = 1
stride = 1
pad = 1
filters = 18
activation = linear


[yolo]
mask = 6,7,8
anchors = 16, 42, 22, 44, 20, 53, 29, 53, 26, 64, 29, 85, 34, 75, 41, 104, 59, 147
classes = 1
num = 9
jitter = .3
ignore_thresh = .7
truth_thresh = 1
random = 1


[route]
layers = -4

[convolutional]
batch_normalize = 1
filters = 256
size = 1
stride = 1
pad = 1
activation = leaky

[upsample]
stride = 2

[route]
layers = -1, 177


[convolutional]
batch_normalize = 1
filters = 256
size = 1
stride = 1
pad = 1
activation = leaky

[convolutional]
batch_normalize = 1
size = 3
stride = 1
pad = 1
filters = 512
activation = leaky

[convolutional]
batch_normalize = 1
filters = 256
size = 1
stride = 1
pad = 1
activation = leaky

[convolutional]
batch_normalize = 1
size = 3
stride = 1
pad = 1
filters = 512
activation = leaky

[convolutional]
batch_normalize = 1
filters = 256
size = 1
stride = 1
pad = 1
activation = leaky

[convolutional]
batch_normalize = 1
size = 3
stride = 1
pad = 1
filters = 512
activation = leaky

[convolutional]
size = 1
stride = 1
pad = 1
filters = 18
activation = linear


[yolo]
mask = 3,4,5
anchors = 16, 42, 22, 44, 20, 53, 29, 53, 26, 64, 29, 85, 34, 75, 41, 104, 59, 147
classes = 1
num = 9
jitter = .3
ignore_thresh = .7
truth_thresh = 1
random = 1



[route]
layers = -4

[convolutional]
batch_normalize = 1
filters = 128
size = 1
stride = 1
pad = 1
activation = leaky

[upsample]
stride = 2

[route]
layers = -1, 109


[convolutional]
batch_normalize = 1
filters = 128
size = 1
stride = 1
pad = 1
activation = leaky

[convolutional]
batch_normalize = 1
size = 3
stride = 1
pad = 1
filters = 256
activation = leaky

[convolutional]
batch_normalize = 1
filters = 128
size = 1
stride = 1
pad = 1
activation = leaky

[convolutional]
batch_normalize = 1
size = 3
stride = 1
pad = 1
filters = 256
activation = leaky

[convolutional]
batch_normalize = 1
filters = 128
size = 1
stride = 1
pad = 1
activation = leaky

[convolutional]
batch_normalize = 1
size = 3
stride = 1
pad = 1
filters = 256
activation = leaky

[convolutional]
size = 1
stride = 1
pad = 1
filters = 18
activation = linear


[yolo]
mask = 0,1,2
anchors = 16, 42, 22, 44, 20, 53, 29, 53, 26, 64, 29, 85, 34, 75, 41, 104, 59, 147
# anchors = 16, 31, 23, 38, 22, 48, 24, 59, 28, 54, 30, 53, 37, 90, 44, 83, 57, 144
classes = 1
num = 9
jitter = .3
ignore_thresh = .7
truth_thresh = 1
random = 1